import 'package:driving_test_app/question_data/Question.dart';

List<Question> getQuestionsForQuiz(int quizNumber) {
  switch (quizNumber) {
    case 1:
      return [
        Question(
          questionTitle: 'کدام تابلو درباره عبور عابر پیاده هشدار می هد؟',
          imageNameNumber: '1',
          correctAnswer: 1,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'کدام تابلو بیانگر کاهش خطوط عبور می باشد؟',
          imageNameNumber: '2',
          correctAnswer: 3,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'عنوان این تابلو چیست؟',
          imageNameNumber: '3',
          correctAnswer: 3,
          answerList: [
            'عبور عابر پیاده ممنوع',
            'گذرگاه عابر پیاده',
            'عبور عابر پیاده',
            'شروع محل پیاده روی',
          ],
        ),
        Question(
          questionTitle: 'این تابلو بیانگر چیست؟',
          imageNameNumber: '4',
          correctAnswer: 0,
          answerList: [
            'جریان همگرا',
            'شروع جدا کننده',
            'تقاطع فرعی به اصلی',
            'هدایت مسیر با جدا کننده',
          ],
        ),
        Question(
          questionTitle: 'این تابلو بیانگر چیست؟',
          imageNameNumber: '5',
          correctAnswer: 1,
          answerList: [
            'عبور با ارتفاع بیش از 2 متر ممنوع',
            'عبور با عرض بیش از 2 متر ممنوع',
            'عبور با بار بیش از 2 تن بر هر محور ممنوع',
            'عبور وسایل نقلیه با وزن بیش از 2 تن ممنوع',
          ],
        ),
        Question(
          questionTitle: 'این تابلو بیانگر چیست؟',
          imageNameNumber: '6',
          correctAnswer: 3,
          answerList: [
            'تقاطع',
            'فقط گردش به چپ مجاز',
            'میدان',
            'جهت عبور در میدان',
          ],
        ),
        Question(
          questionTitle: 'مفهوم این تابلو چیست؟',
          imageNameNumber: '7',
          correctAnswer: 1,
          answerList: [
            'عبور وسایل نقلیه موتوری ممنوع',
            'عبور سوار ممنوع',
            'عبور کلیه وسایل نقلیه ممنوع',
            'ورود سواری ممنوع',
          ],
        ),
        Question(
          questionTitle: 'این تصویر بیانگر چیست؟',
          imageNameNumber: '8',
          correctAnswer: 3,
          answerList: [
            'رانندگی بین خطوط',
            'ممنوعیت عبور از روی خطوط زیکزاگ',
            'خط کشی عرض ممتد ایست',
            'ممنوعیت حرکت روی خطوط هاشوردر حاشیه راه‌ها',
          ],
        ),
        Question(
          questionTitle: 'استفاده از بوق در کدام یک از موارد زیر مجاز است؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'اطلاع و آگاه‌سازی سایر کاربران برای جلوگیری از بروز سانحه و خطر',
            'اطلاع و آگاه‌سازی برای ادای احترام به سایر کاربران راه',
            'برای کاهش شدت تصادفات',
            'برای کاهش شدت تصادفات و ادای احترام به سایر کاربران راه',
          ],
        ),
        Question(
          questionTitle:
              'کدام یک از وسایل نقلیه زیر نسبت به دیگر وسایل نقلیه از ایمنی کمتری برخوردارند؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'خودروهای سواری',
            'کامیون‌ها و اتوبوس‌ها',
            'موتور سیکلت‌ها و دوچرخه‌ها',
            'وسایل نقلیه کشاورزی',
          ],
        ),
        Question(
          questionTitle: 'منظور از این چراغ چیست؟',
          imageNameNumber: '9',
          correctAnswer: 1,
          answerList: [
            'در این حالت عبور مستقیم و گردش در جهت پیکان مجاز می‌باشد',
            'عبور مستقیم مجاز بوده ولی گردش به سمت پیکان غیر مجاز می‌باشد',
            'حرکت به صورت مستقیم ممنوع',
            'صرفا می‌توان به سمت راست حرکت نمود',
          ],
        ),
        Question(
          questionTitle:
              'به همراه چراغ چشمک زن قرمز معمولا کدام تابلوی راهنمایی و رانندگی نصب می‌گردد؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            'فقط عبور مستقیم مجاز',
            'گردش به چپ ممنوع',
            'فقط عبور به راست مجاز',
            'ایست و رعایت حق تقدم',
          ],
        ),
        Question(
          questionTitle:
              'در آزادراه‌های برون‌شهری و مناطق غیر مسکونی، حداقل سرعت چند کیلومتر در ساعت است؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: ['130', '70', '85', '95'],
        ),
        Question(
          questionTitle:
              '...در برخورد راه اصلی با راه فرعی، تقدم عبور با وسیله‌ای است که',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: [
            'از راه اصلی عبور می‌کند',
            'از راه فرعی عبور می‌کند',
            'به سمت راست گردش می‌کند',
            'در طرف راست وسیله نقلیه دیگر قرار دارد',
          ],
        ),
        Question(
          questionTitle: 'منظور از توقف چیست؟',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: [
            'ایست وسیله نقلیه در زمانی بدون حضور راننده',
            'ایست وسیله نقلیه در زمان کوتاه',
            'ایست وسیله نقلیه در زمانی طولانی با حضور راننده',
            'ایست وسیله نقلیه برای هر مدت ممنوع',
          ],
        ),
        Question(
          questionTitle:
              'هرگاه وسیله نقلیه‌ای شب در کنار و بیرون سطح راه توقف نماید و نور کافی در آن محل برای تشخیص اشخاص از فاصله 150 متر وجود نداشته باشد، انجام کدام یک از موارد زیر ضروری است؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'نگهداشتن پدال ترمز برای روشن شدن چراغ ترمز',
            'روشن نمودن چراغ‌های بزرگ با نور بالا',
            'روشن نگهداشتن چراغ‌های کوچک جلو و خطر عقب وسیله نقلیه',
            'روشن نمودن راهنمای سمت راست خودرو',
          ],
        ),
        Question(
          questionTitle: 'از چند متری پیچ‌ها سبقت گرفتن ممنوع است؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            '150 متر',
            '100 متر',
            '50 متر',
            'سبقت گرفتن در پیچ‌ها محدودیت ندارد',
          ],
        ),
        Question(
          questionTitle:
              'علاوه بر اینکه کلید ترن ابزار در کنترل خودرو می‌باشد، می‌تواند به عنوان بازخوردی مناسب برای صحت یا عدم سلامت بخش‌های مهمی از خودرو و همچنین سیستم جلوبندی و وضعیت فرمان‌پذیری را آشکار نماید...',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'پدال گاز',
            'غربیلک فرمان',
            'پدال ترمز',
            'آینه بغل',
          ],
        ),
        Question(
          questionTitle: 'کدامیک جزو وظایف سیستم تعلیق نمی‌باشد؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'تامین راحتی راننده',
            'کنترل قدرت و شتاب خودرو',
            'حفظ تعادل و پایداری خودرو به هنگام عبور از پستی یا بلندی',
            'پیشگیری از واژگونی خودرو هنگام گذر از پیچ‌های بلند',
          ],
        ),
        Question(
          questionTitle:
              'استفاده از کدام نوع کمربند ایمنی در خودرو الزامی است؟',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: [
            'سه نقطه‌ای',
            'دو نقطه‌ای',
            'کمربند ران',
            'نوع کمربند ایمنی مهم نیست',
          ],
        ),
        Question(
          questionTitle:
              'کدامیک از موارد زیر در خصوص کمک‌های اولیه صحیح می‌باشد؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'انجام کمک‌های اولیه حتما باید توسط پزشکان صورت پذیرد',
            'کمک‌های اولیه می‌تواند در محل حادثه یا بیمارستان انجام شود',
            'کمک‌های اولیه سبب کاهش چشمگیر مرگ و میر و تخفیف بیماری و آسیب‌های مصدوم می‌شود',
            'کمک‌های اولیه تاثیری در تخفیف بیماری و آسیب‌های مجروح نداشته و صرفاً جهت بالا بردن روحیه بیمار صورت می‌گیرد',
          ],
        ),
        Question(
          questionTitle:
              'این صفات جزو کدام نوع از رانندگان می‌باشد: تغییر مسیر ناگهانی و خطرآفرین برای سایر رانندگان، قرار گرفتن به مدت طولانی در خط سرعت به منظور تنبیه اتومبیل پشت سر و استفاده از نور بالا برای آزار رساندن به راننده مقابل؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'رانندگان مسن',
            'رانندگان پرخاشگر',
            'رانندگان جوان',
            'رانندگان بی‌تجربه',
          ],
        ),
        Question(
          questionTitle: 'این شکل بیانگر چیست؟',
          imageNameNumber: '10',
          correctAnswer: 1,
          answerList: [
            'سواری در حال سبقت گرفتن عبور از موتور سوار است',
            'موتور سوار در نقطه کور سواری قرار دارد',
            'عدم رانندگی بین خطوط',
            'سبقت غیر مجاز',
          ],
        ),
        Question(
          questionTitle: 'مفهوم خطوط طولی در این شکل چیست؟',
          imageNameNumber: '11',
          correctAnswer: 0,
          answerList: [
            'به هیچ عنوان نباید از روی آن عبور نمود',
            'عبور از روی آن مجاز می‌باشد',
            'با احتیاط می‌توان از روی آن دور زد',
            'در صورت لزوم می‌توان از روی آن سبقت گرفت',
          ],
        ),
        Question(
          questionTitle: 'در خیابان‌ها و جاده‌هایی که نور کم وجود دارد...',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'باید از نور بالا استفاده نمود',
            'باید تنها از چراغ‌های جانبی جلو و عقب استفاده نمود',
            'باید تنها از نور پایین استفاده نمود',
            'تمام چراغ‌ها را باید خاموش نمود',
          ],
        ),
        Question(
          questionTitle: 'ورود و عبور عابرین پیاده در آزادراه‌ها...',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'با رعایت ضوابط و مقررات مجاز است',
            'ممنوع است',
            'در مواقع اضطراری مجاز است',
            'با رعایت نکات ایمنی مجاز است',
          ],
        ),
        Question(
          questionTitle:
              'سرعت مجاز برای عبور خودروها در جاده‌های اصلی در روز حداکثر... و شب‌ها حداکثر... کیلومتر در ساعت است',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            '100,110',
            '100,90',
            '85,95',
            '110,100',
          ],
        ),
        Question(
          questionTitle:
              'محدودیت‌های حرکت و سرعت در جاده‌ها به وسیله... تعیین می‌گردد',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'رانندگان',
            'علایم و تابلوها',
            'استفاده‌کنندگان از راه',
            'افراد صلاحیت‌دار',
          ],
        ),
        Question(
          questionTitle:
              'رانندگان با مشاهده چراغ چشمک زن زرد در تقاطع باید چه عملی را انجام دهند؟',
          imageNameNumber: '12',
          correctAnswer: 0,
          answerList: [
            'با احتیاط کامل و سرعت کم عبور نمایند',
            'با زدن بوق و با سرعت اولیه به حرکت خود ادامه دهند',
            'در صورت ضرورت بر سرعت خود بیفزایند',
            'با روشن نمودن چراغ خودرو از تقاطع عبور نمایند',
          ],
        ),
        Question(
          questionTitle: 'کدام مورد زیر صحیح نمی‌باشد؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            'کنترل دوره‌ای تایر زاپاس مهم می‌باشد',
            'عدم تنظیم چرخ‌ها در ساییدگی نامتوازن تایرها مؤثر است',
            'یکی از نکات مهم در خصوص سیستم ترمز، کنترل روغن ترمز است',
            'در صورتی که باد تایر بیشتر از حد مجاز باشد، سطح اتصال تایر با زمین در بیشترین حد خود قرار می‌گیرد',
          ],
        ),
      ];
    case 2:
      return [
        Question(
          questionTitle:
              'کدام تابلو ممنوعیت عبور وسایل نقلیه موتوری را اعلام می دارد؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'کدام تابلو بیانگر خط عبور برای گریز می باشد؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'عنوان این تابلو چیست؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'این تابلو بیانگر چیست؟',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'این تابلو بیانگر چیست؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'این تابلو بیانگر چیست؟',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: ['1', '2', '3', '4'],
        ),
        Question(
          questionTitle: 'کدام گزینه درمورد این شکل درست است؟',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: [
            '.رانندگان باید قبل از خط ممتد ایست که معمولا در تقاطع ها کشیده می شود توقف کامل نمایند',
            '.رانندگان با مشاهد این خطوط از سرعت خود کاسته وبا رعایت حق تقدم عبور و وارد راه اصلی نمی شوند',
            '.رانندگان با مشاهده این خطوط از سرعت خود کاسته و با احتیاط عبور نمایند',
            '.رانندگان با مشاهده این خطوط از سرعت خود کاسته و با رعایت احتیاط و حق تقدم وارد راه اصلی می شوند.',
          ],
        ),
        Question(
          questionTitle:
              '.شکل مستطیل قائم معمولا برای چه نوع تابلو هایی استفاده می شود',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'شروع وپایان حق تقدم درمسیر',
            'راهنماو هشتدار',
            'دستوری وخدمات',
            'دستوری یا بازدارند'
          ],
        ),
        Question(
          questionTitle: 'کدام از موارد زیر، مفهوم چراغ قرمز می باشد؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            '.این چراغ نشان دهنده آن است که می تواند با احتیاط از تقاطع عبور نمایید',
            '.به معنی هشدار جهت تغیر رنگ چراع است و باید با دیدن آن توقف ، سپس حرکت نمایید',
            '.با دیدن این چراغ شما می توانید به آرامی و در صورتیکه معبر خالی است از تقاطع عبور نمایید',
            '.این چراغ به معنی توقف می باشد و بادیدن آن باید پشت خط ایست توقف نمود'
          ],
        ),
        Question(
          questionTitle:
              '.کدامیک ازمواردزیر نشان دهنده بوجود آمدن حالت خستگی و خواب آلودگی درحین رانندگی است ',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'پلک زدن کنترل بین خطوط عدم تمرکز بر روی رانندگی و رویا پردازی',
            'احساس سنگینی و عدم توانایی کنترل خودروخطوط',
            'احساس سنگینی در پلکها عدم کنترل آگاهانه بر سرعت خودرو و عدم تمرکز روی رانندگی و رویا پردازی در ذهن ',
            'افزایش سرعت واکنش نسبت به شرایط احساس سنگینی در پلکها عدم کنترل آگاهانه بر روی سرعت خودرو'
          ],
        ),
        Question(
          questionTitle:
              'الکل و مواد مخدر بر کدام یک از موارد زیر تأثیر منفی می‌گذارد؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            'توانایی ذهنی',
            'هوشیاری دید',
            'تشخیص موقعیت‌های خطرناک',
            'تمرکز و کنترل سرعت',
            'تمامی موارد'
          ],
        ),
        Question(
          questionTitle:
              'با مشاهده چراغ قرمز راهنمایی و در صورت نبودن خط ایست برای توقف، در چند متری چراغ باید توقف کنیم؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: ['یک متری', 'پنج متری', 'دو متری', 'چهار متری'],
        ),
        Question(
          questionTitle:
              'در بزرگراه رانندگی، حد اکثر سرعت چند کیلومتر در ساعت است؟',
          imageNameNumber: '500',
          correctAnswer: 0,
          answerList: ['100', '120', '125'],
        ),
        Question(
          questionTitle:
              'هر گرد دو یا چند وسیله نقلیه از دو یا چند راه مختلف به تقاطع هم عرض برسند، حق تقدم عبور با وسیله‌ای است که...',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'دارای سرنشین بیشتری است',
            'به سمت راست گردش می‌کند',
            'در طرف راست وسیله نقلیه دیگر قرار دارد',
            'دارای سرعت بیشتری است'
          ],
        ),
        Question(
          questionTitle: ' .ایستادن ممنوع همان ......است',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            ' توقف',
            'توقف مطلقا ممنوع',
            'توقف ممنوع',
            'ایست وسیع نقلیه در زمان کوتاه'
          ],
        ),
        Question(
          questionTitle:
              '.....برای کاستن سرعت هنگامی که وسیله نقلیه فاقد چراغ راهنما باشد، باید',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            'دست راست را به طرف راست نگه‌داشت',
            'دست چپ را به طرف بالا نگه‌داشت',
            'دست چپ را به طور افقی نگه‌داشت',
            'دست چپ را به صورت عمودی از بالا به پایین حرکت داد'
          ],
        ),
        Question(
          questionTitle:
              'تردد کلیه وسایل نقلیه در خط سوم آزادراه‌ها ممنوع نیست؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: [
            'اوتوبوس',
            'وانت‌ها',
            'مینی بوس',
            'انواع بارکش‌ها با وزن بیش از سه تن'
          ],
        ),
        Question(
          questionTitle: 'چه هنگامی می‌توانند ترمز دستی استفاده نمود؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            'هنگامی  توقف در سرازیری‌ها یا سر بالایی‌ها',
            'در هر شرایطی',
            'تنها در سرعتهای بالا',
            'هنگامی توقف خودرویادر سرعت های بسیار پایین '
          ],
        ),
        Question(
          questionTitle:
              'روزانه کارایی روغن‌های معمولی موتور معمولاً چند کیلومتر می‌باشد؟',
          imageNameNumber: '500',
          correctAnswer: 2,
          answerList: [
            'حدود دو هزار کیلومتر',
            'حدود چهل تا پنجاه هزار کیلومتر',
            'هشت تا ده هزار کیلومتر',
            'پنجاه هزار کیلومتر'
          ],
        ),
        Question(
          questionTitle: 'کدام یک جزء سیستم انتقال قدرت نمی‌باشد؟',
          imageNameNumber: '500',
          correctAnswer: 1,
          answerList: ['کلاچ', 'میلنگ', 'گیربکس', 'دیفرانسیال'],
        ),
        Question(
          questionTitle:
              'کدام یکی از موارد زیر در خصوص ایمن کردن صحنه حادثه می‌باشد؟',
          imageNameNumber: '500',
          correctAnswer: 3,
          answerList: [
            'پارک خودرو در فاصله مناسب، استفاده از تابلو اعلان خطر، مطمئن شدن از این که خطری شما را تهدید نمی‌کند',
            'پارک خودرو در فاصله مناسب، کشیدن چند نفس عمیق و آرام، استفاده از تابلو اعلان خطر',
            'استفاده از تابلو اعلان خطر، گرفتن شرح حال از مصدومین، کشیدن چند نفس آرام و عمیق',
            'پارک خودرو در فاصله مناسب، بررسی وضعیت مصدومین، دور کردن مصدوم از صحنه حادثه'
          ],
        ),
      ];
    default:
      return [];
  }
}
